[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:3:3
 export default [
   'forward 2',
-  'forward 2',
+  "",
   'down 7',
   'forward 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:4:3
 export default [
   'forward 2',
   'forward 2',
-  'down 7',
+  "",
   'forward 6',
   'down 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:9:3
   'down 7',
   'forward 4',
   'down 7',
-  'up 2',
+  "",
   'forward 4',
   'down 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:10:3
   'forward 4',
   'down 7',
   'up 2',
-  'forward 4',
+  "",
   'down 2',
   'down 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:11:3
   'down 7',
   'up 2',
   'forward 4',
-  'down 2',
+  "",
   'down 4',
   'down 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:15:3
   'down 4',
   'down 5',
   'forward 4',
-  'up 1',
+  "",
   'up 2',
   'forward 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:18:3
   'up 1',
   'up 2',
   'forward 9',
-  'forward 7',
+  "",
   'down 1',
   'forward 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:19:3
   'up 2',
   'forward 9',
   'forward 7',
-  'down 1',
+  "",
   'forward 4',
   'forward 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:21:3
   'forward 7',
   'down 1',
   'forward 4',
-  'forward 7',
+  "",
   'forward 9',
   'down 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:24:3
   'forward 7',
   'forward 9',
   'down 2',
-  'down 3',
+  "",
   'forward 1',
   'forward 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:28:3
   'forward 1',
   'forward 4',
   'forward 6',
-  'up 2',
+  "",
   'forward 6',
   'down 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:30:3
   'forward 6',
   'up 2',
   'forward 6',
-  'down 2',
+  "",
   'down 5',
   'up 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:32:3
   'forward 6',
   'down 2',
   'down 5',
-  'up 4',
+  "",
   'down 5',
   'forward 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:33:3
   'down 2',
   'down 5',
   'up 4',
-  'down 5',
+  "",
   'forward 6',
   'down 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:37:3
   'forward 6',
   'down 7',
   'down 4',
-  'up 5',
+  "",
   'forward 9',
   'forward 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:38:3
   'down 7',
   'down 4',
   'up 5',
-  'forward 9',
+  "",
   'forward 5',
   'down 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:41:3
   'forward 9',
   'forward 5',
   'down 8',
-  'forward 3',
+  "",
   'forward 1',
   'down 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:42:3
   'forward 5',
   'down 8',
   'forward 3',
-  'forward 1',
+  "",
   'down 7',
   'down 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:43:3
   'down 8',
   'forward 3',
   'forward 1',
-  'down 7',
+  "",
   'down 5',
   'forward 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:44:3
   'forward 3',
   'forward 1',
   'down 7',
-  'down 5',
+  "",
   'forward 2',
   'down 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:48:3
   'forward 2',
   'down 3',
   'forward 8',
-  'down 1',
+  "",
   'forward 4',
   'up 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:49:3
   'down 3',
   'forward 8',
   'down 1',
-  'forward 4',
+  "",
   'up 8',
   'up 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:52:3
   'forward 4',
   'up 8',
   'up 8',
-  'up 8',
+  "",
   'forward 2',
   'down 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:56:3
   'forward 2',
   'down 3',
   'down 5',
-  'up 8',
+  "",
   'forward 1',
   'forward 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:61:3
   'forward 3',
   'up 1',
   'up 2',
-  'up 4',
+  "",
   'down 8',
   'forward 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:62:3
   'up 1',
   'up 2',
   'up 4',
-  'down 8',
+  "",
   'forward 5',
   'down 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:66:3
   'forward 5',
   'down 9',
   'down 9',
-  'forward 9',
+  "",
   'up 3',
   'down 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:69:3
   'forward 9',
   'up 3',
   'down 2',
-  'down 9',
+  "",
   'up 8',
   'forward 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:71:3
   'down 2',
   'down 9',
   'up 8',
-  'forward 3',
+  "",
   'up 2',
   'down 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:75:3
   'up 2',
   'down 7',
   'forward 9',
-  'forward 1',
+  "",
   'up 1',
   'forward 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:80:3
   'forward 9',
   'forward 1',
   'down 1',
-  'forward 7',
+  "",
   'up 3',
   'up 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:82:3
   'down 1',
   'forward 7',
   'up 3',
-  'up 5',
+  "",
   'forward 3',
   'forward 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:83:3
   'forward 7',
   'up 3',
   'up 5',
-  'forward 3',
+  "",
   'forward 8',
   'forward 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:84:3
   'up 3',
   'up 5',
   'forward 3',
-  'forward 8',
+  "",
   'forward 4',
   'down 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:85:3
   'up 5',
   'forward 3',
   'forward 8',
-  'forward 4',
+  "",
   'down 3',
   'forward 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:89:3
   'down 3',
   'forward 5',
   'forward 4',
-  'forward 2',
+  "",
   'down 2',
   'down 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:92:3
   'forward 2',
   'down 2',
   'down 3',
-  'forward 1',
+  "",
   'up 2',
   'up 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:95:3
   'forward 1',
   'up 2',
   'up 2',
-  'down 9',
+  "",
   'down 6',
   'down 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:96:3
   'up 2',
   'up 2',
   'down 9',
-  'down 6',
+  "",
   'down 6',
   'up 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:97:3
   'up 2',
   'down 9',
   'down 6',
-  'down 6',
+  "",
   'up 2',
   'down 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:99:3
   'down 6',
   'down 6',
   'up 2',
-  'down 6',
+  "",
   'forward 6',
   'forward 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:100:3
   'down 6',
   'up 2',
   'down 6',
-  'forward 6',
+  "",
   'forward 5',
   'down 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:101:3
   'up 2',
   'down 6',
   'forward 6',
-  'forward 5',
+  "",
   'down 8',
   'up 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:102:3
   'down 6',
   'forward 6',
   'forward 5',
-  'down 8',
+  "",
   'up 3',
   'up 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:108:3
   'up 1',
   'forward 8',
   'down 3',
-  'down 5',
+  "",
   'forward 8',
   'forward 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:109:3
   'forward 8',
   'down 3',
   'down 5',
-  'forward 8',
+  "",
   'forward 7',
   'down 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:119:3
   'down 9',
   'forward 2',
   'forward 2',
-  'down 5',
+  "",
   'up 8',
   'forward 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:121:3
   'forward 2',
   'down 5',
   'up 8',
-  'forward 9',
+  "",
   'down 7',
   'down 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:127:3
   'forward 2',
   'forward 9',
   'forward 1',
-  'forward 3',
+  "",
   'forward 1',
   'forward 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:132:3
   'forward 3',
   'down 4',
   'forward 6',
-  'forward 4',
+  "",
   'down 7',
   'up 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:134:3
   'forward 6',
   'forward 4',
   'down 7',
-  'up 4',
+  "",
   'up 5',
   'forward 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:136:3
   'down 7',
   'up 4',
   'up 5',
-  'forward 1',
+  "",
   'down 4',
   'down 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:141:3
   'down 8',
   'down 3',
   'down 8',
-  'up 3',
+  "",
   'forward 2',
   'up 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:142:3
   'down 3',
   'down 8',
   'up 3',
-  'forward 2',
+  "",
   'up 7',
   'down 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:144:3
   'up 3',
   'forward 2',
   'up 7',
-  'down 1',
+  "",
   'down 7',
   'down 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:146:3
   'up 7',
   'down 1',
   'down 7',
-  'down 3',
+  "",
   'forward 3',
   'forward 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:147:3
   'down 1',
   'down 7',
   'down 3',
-  'forward 3',
+  "",
   'forward 4',
   'up 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:148:3
   'down 7',
   'down 3',
   'forward 3',
-  'forward 4',
+  "",
   'up 8',
   'down 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:150:3
   'forward 3',
   'forward 4',
   'up 8',
-  'down 2',
+  "",
   'forward 8',
   'down 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:152:3
   'up 8',
   'down 2',
   'forward 8',
-  'down 8',
+  "",
   'up 8',
   'up 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:154:3
   'forward 8',
   'down 8',
   'up 8',
-  'up 5',
+  "",
   'forward 5',
   'forward 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:155:3
   'down 8',
   'up 8',
   'up 5',
-  'forward 5',
+  "",
   'forward 1',
   'forward 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:157:3
   'up 5',
   'forward 5',
   'forward 1',
-  'forward 5',
+  "",
   'up 4',
   'down 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:158:3
   'forward 5',
   'forward 1',
   'forward 5',
-  'up 4',
+  "",
   'down 5',
   'down 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:167:3
   'down 9',
   'forward 4',
   'down 5',
-  'down 5',
+  "",
   'forward 9',
   'forward 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:170:3
   'down 5',
   'forward 9',
   'forward 7',
-  'down 3',
+  "",
   'down 4',
   'forward 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:171:3
   'forward 9',
   'forward 7',
   'down 3',
-  'down 4',
+  "",
   'forward 2',
   'down 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:175:3
   'forward 2',
   'down 7',
   'down 3',
-  'down 9',
+  "",
   'down 8',
   'forward 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:176:3
   'down 7',
   'down 3',
   'down 9',
-  'down 8',
+  "",
   'forward 6',
   'forward 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:185:3
   'down 4',
   'forward 9',
   'down 9',
-  'down 5',
+  "",
   'up 8',
   'forward 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:189:3
   'up 8',
   'forward 1',
   'forward 3',
-  'down 1',
+  "",
   'down 4',
   'forward 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:191:3
   'forward 3',
   'down 1',
   'down 4',
-  'forward 1',
+  "",
   'up 5',
   'down 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:193:3
   'down 4',
   'forward 1',
   'up 5',
-  'down 9',
+  "",
   'forward 8',
   'down 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:194:3
   'forward 1',
   'up 5',
   'down 9',
-  'forward 8',
+  "",
   'down 8',
   'down 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:202:3
   'forward 9',
   'forward 7',
   'up 3',
-  'down 3',
+  "",
   'forward 4',
   'down 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:216:3
   'up 5',
   'forward 9',
   'forward 8',
-  'down 7',
+  "",
   'up 5',
   'up 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:220:3
   'up 5',
   'up 8',
   'down 4',
-  'down 9',
+  "",
   'forward 5',
   'up 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:223:3
   'down 9',
   'forward 5',
   'up 6',
-  'forward 7',
+  "",
   'down 4',
   'forward 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:232:3
   'forward 4',
   'down 8',
   'down 3',
-  'down 3',
+  "",
   'forward 1',
   'up 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:236:3
   'forward 1',
   'up 7',
   'forward 5',
-  'forward 1',
+  "",
   'down 5',
   'forward 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:238:3
   'forward 5',
   'forward 1',
   'down 5',
-  'forward 4',
+  "",
   'down 3',
   'down 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:243:3
   'down 4',
   'forward 4',
   'down 5',
-  'up 9',
+  "",
   'forward 6',
   'down 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:244:3
   'forward 4',
   'down 5',
   'up 9',
-  'forward 6',
+  "",
   'down 6',
   'up 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:254:3
   'forward 7',
   'down 2',
   'forward 1',
-  'forward 4',
+  "",
   'down 7',
   'forward 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:255:3
   'down 2',
   'forward 1',
   'forward 4',
-  'down 7',
+  "",
   'forward 1',
   'up 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:257:3
   'forward 4',
   'down 7',
   'forward 1',
-  'up 8',
+  "",
   'forward 6',
   'forward 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:259:3
   'forward 1',
   'up 8',
   'forward 6',
-  'forward 2',
+  "",
   'forward 5',
   'up 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:262:3
   'forward 2',
   'forward 5',
   'up 1',
-  'forward 6',
+  "",
   'up 7',
   'down 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:263:3
   'forward 5',
   'up 1',
   'forward 6',
-  'up 7',
+  "",
   'down 8',
   'down 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:264:3
   'up 1',
   'forward 6',
   'up 7',
-  'down 8',
+  "",
   'down 5',
   'down 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:265:3
   'forward 6',
   'up 7',
   'down 8',
-  'down 5',
+  "",
   'down 2',
   'forward 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:266:3
   'up 7',
   'down 8',
   'down 5',
-  'down 2',
+  "",
   'forward 4',
   'forward 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:269:3
   'down 2',
   'forward 4',
   'forward 3',
-  'down 7',
+  "",
   'up 5',
   'forward 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:274:3
   'forward 1',
   'forward 2',
   'forward 3',
-  'forward 6',
+  "",
   'down 9',
   'down 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:278:3
   'down 9',
   'down 2',
   'forward 7',
-  'up 3',
+  "",
   'down 4',
   'forward 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:285:3
   'forward 6',
   'up 2',
   'down 4',
-  'forward 8',
+  "",
   'down 3',
   'down 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:292:3
   'forward 3',
   'forward 8',
   'forward 1',
-  'forward 6',
+  "",
   'forward 1',
   'forward 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:299:3
   'up 3',
   'up 5',
   'forward 4',
-  'forward 6',
+  "",
   'down 3',
   'forward 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:300:3
   'up 5',
   'forward 4',
   'forward 6',
-  'down 3',
+  "",
   'forward 5',
   'forward 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:305:3
   'forward 5',
   'down 9',
   'forward 4',
-  'down 5',
+  "",
   'forward 6',
   'down 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:309:3
   'forward 6',
   'down 1',
   'forward 2',
-  'forward 3',
+  "",
   'forward 2',
   'up 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:311:3
   'forward 2',
   'forward 3',
   'forward 2',
-  'up 4',
+  "",
   'forward 9',
   'forward 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:312:3
   'forward 3',
   'forward 2',
   'up 4',
-  'forward 9',
+  "",
   'forward 7',
   'forward 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:318:3
   'up 1',
   'down 6',
   'down 1',
-  'forward 5',
+  "",
   'up 4',
   'up 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:324:3
   'forward 5',
   'forward 3',
   'up 9',
-  'down 4',
+  "",
   'forward 7',
   'up 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:325:3
   'forward 3',
   'up 9',
   'down 4',
-  'forward 7',
+  "",
   'up 9',
   'down 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:328:3
   'forward 7',
   'up 9',
   'down 7',
-  'forward 5',
+  "",
   'down 4',
   'down 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:329:3
   'up 9',
   'down 7',
   'forward 5',
-  'down 4',
+  "",
   'down 9',
   'up 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:331:3
   'forward 5',
   'down 4',
   'down 9',
-  'up 4',
+  "",
   'forward 2',
   'forward 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:332:3
   'down 4',
   'down 9',
   'up 4',
-  'forward 2',
+  "",
   'forward 2',
   'forward 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:334:3
   'up 4',
   'forward 2',
   'forward 2',
-  'forward 1',
+  "",
   'forward 3',
   'forward 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:340:3
   'down 3',
   'down 5',
   'up 9',
-  'forward 8',
+  "",
   'up 5',
   'down 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:343:3
   'forward 8',
   'up 5',
   'down 3',
-  'forward 5',
+  "",
   'down 4',
   'forward 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:346:3
   'forward 5',
   'down 4',
   'forward 1',
-  'forward 1',
+  "",
   'up 5',
   'down 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:347:3
   'down 4',
   'forward 1',
   'forward 1',
-  'up 5',
+  "",
   'down 7',
   'up 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:356:3
   'down 3',
   'down 5',
   'down 2',
-  'down 7',
+  "",
   'down 5',
   'down 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:358:3
   'down 2',
   'down 7',
   'down 5',
-  'down 1',
+  "",
   'up 3',
   'forward 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:359:3
   'down 7',
   'down 5',
   'down 1',
-  'up 3',
+  "",
   'forward 5',
   'forward 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:361:3
   'down 1',
   'up 3',
   'forward 5',
-  'forward 9',
+  "",
   'up 1',
   'down 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:363:3
   'forward 5',
   'forward 9',
   'up 1',
-  'down 8',
+  "",
   'up 5',
   'forward 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:367:3
   'up 5',
   'forward 4',
   'down 5',
-  'forward 5',
+  "",
   'down 3',
   'up 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:370:3
   'forward 5',
   'down 3',
   'up 8',
-  'forward 2',
+  "",
   'up 7',
   'down 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:372:3
   'up 8',
   'forward 2',
   'up 7',
-  'down 4',
+  "",
   'forward 1',
   'up 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:375:3
   'down 4',
   'forward 1',
   'up 6',
-  'down 7',
+  "",
   'down 4',
   'forward 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:377:3
   'up 6',
   'down 7',
   'down 4',
-  'forward 9',
+  "",
   'forward 3',
   'forward 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:380:3
   'forward 9',
   'forward 3',
   'forward 7',
-  'up 5',
+  "",
   'down 1',
   'down 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:383:3
   'up 5',
   'down 1',
   'down 3',
-  'up 2',
+  "",
   'forward 3',
   'down 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:384:3
   'down 1',
   'down 3',
   'up 2',
-  'forward 3',
+  "",
   'down 8',
   'up 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:387:3
   'forward 3',
   'down 8',
   'up 7',
-  'forward 9',
+  "",
   'forward 9',
   'forward 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:390:3
   'forward 9',
   'forward 9',
   'forward 9',
-  'down 3',
+  "",
   'forward 4',
   'forward 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:394:3
   'forward 4',
   'forward 9',
   'down 6',
-  'up 1',
+  "",
   'up 7',
   'down 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:395:3
   'forward 9',
   'down 6',
   'up 1',
-  'up 7',
+  "",
   'down 3',
   'forward 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:397:3
   'up 1',
   'up 7',
   'down 3',
-  'forward 4',
+  "",
   'forward 9',
   'down 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:398:3
   'up 7',
   'down 3',
   'forward 4',
-  'forward 9',
+  "",
   'down 9',
   'up 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:405:3
   'forward 6',
   'forward 4',
   'down 5',
-  'up 3',
+  "",
   'down 6',
   'up 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:407:3
   'down 5',
   'up 3',
   'down 6',
-  'up 4',
+  "",
   'down 5',
   'down 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:415:3
   'down 2',
   'forward 1',
   'forward 8',
-  'up 7',
+  "",
   'forward 4',
   'down 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:416:3
   'forward 1',
   'forward 8',
   'up 7',
-  'forward 4',
+  "",
   'down 5',
   'down 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:419:3
   'forward 4',
   'down 5',
   'down 3',
-  'up 7',
+  "",
   'forward 1',
   'forward 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:424:3
   'forward 7',
   'up 6',
   'forward 4',
-  'forward 5',
+  "",
   'forward 3',
   'forward 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:427:3
   'forward 5',
   'forward 3',
   'forward 1',
-  'down 5',
+  "",
   'up 3',
   'up 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:430:3
   'down 5',
   'up 3',
   'up 3',
-  'down 8',
+  "",
   'forward 1',
   'forward 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:433:3
   'down 8',
   'forward 1',
   'forward 2',
-  'up 6',
+  "",
   'down 3',
   'down 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:434:3
   'forward 1',
   'forward 2',
   'up 6',
-  'down 3',
+  "",
   'down 6',
   'down 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:438:3
   'down 6',
   'down 5',
   'down 4',
-  'up 1',
+  "",
   'down 9',
   'forward 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:444:3
   'down 8',
   'up 9',
   'down 3',
-  'forward 6',
+  "",
   'down 8',
   'forward 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:451:3
   'forward 6',
   'forward 3',
   'forward 6',
-  'up 6',
+  "",
   'up 3',
   'down 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:452:3
   'forward 3',
   'forward 6',
   'up 6',
-  'up 3',
+  "",
   'down 6',
   'up 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:471:3
   'forward 2',
   'forward 2',
   'up 4',
-  'down 7',
+  "",
   'down 2',
   'up 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:473:3
   'up 4',
   'down 7',
   'down 2',
-  'up 2',
+  "",
   'down 2',
   'up 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:474:3
   'down 7',
   'down 2',
   'up 2',
-  'down 2',
+  "",
   'up 9',
   'forward 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:475:3
   'down 2',
   'up 2',
   'down 2',
-  'up 9',
+  "",
   'forward 4',
   'forward 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:483:3
   'down 7',
   'forward 5',
   'down 5',
-  'forward 1',
+  "",
   'down 4',
   'forward 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:484:3
   'forward 5',
   'down 5',
   'forward 1',
-  'down 4',
+  "",
   'forward 4',
   'up 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:497:3
   'forward 1',
   'down 6',
   'forward 8',
-  'down 5',
+  "",
   'forward 7',
   'down 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:499:3
   'forward 8',
   'down 5',
   'forward 7',
-  'down 4',
+  "",
   'forward 2',
   'down 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:500:3
   'down 5',
   'forward 7',
   'down 4',
-  'forward 2',
+  "",
   'down 3',
   'down 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:501:3
   'forward 7',
   'down 4',
   'forward 2',
-  'down 3',
+  "",
   'down 1',
   'forward 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:503:3
   'forward 2',
   'down 3',
   'down 1',
-  'forward 6',
+  "",
   'forward 4',
   'down 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:505:3
   'down 1',
   'forward 6',
   'forward 4',
-  'down 9',
+  "",
   'forward 3',
   'up 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:508:3
   'down 9',
   'forward 3',
   'up 4',
-  'up 8',
+  "",
   'down 2',
   'up 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:513:3
   'up 5',
   'up 8',
   'up 7',
-  'down 2',
+  "",
   'down 9',
   'forward 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:520:3
   'up 7',
   'forward 2',
   'up 4',
-  'forward 7',
+  "",
   'down 3',
   'down 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:524:3
   'down 3',
   'down 3',
   'down 6',
-  'up 3',
+  "",
   'down 6',
   'down 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:531:3
   'down 6',
   'up 9',
   'down 6',
-  'forward 3',
+  "",
   'forward 8',
   'forward 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:551:3
   'forward 4',
   'down 4',
   'down 9',
-  'forward 7',
+  "",
   'forward 4',
   'forward 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:552:3
   'down 4',
   'down 9',
   'forward 7',
-  'forward 4',
+  "",
   'forward 4',
   'up 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:556:3
   'forward 4',
   'up 3',
   'up 6',
-  'forward 4',
+  "",
   'forward 7',
   'forward 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:560:3
   'forward 7',
   'forward 4',
   'down 2',
-  'forward 8',
+  "",
   'up 4',
   'forward 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:573:3
   'forward 6',
   'forward 2',
   'up 9',
-  'forward 5',
+  "",
   'up 3',
   'forward 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:581:3
   'forward 6',
   'up 6',
   'down 6',
-  'down 1',
+  "",
   'forward 2',
   'down 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:582:3
   'up 6',
   'down 6',
   'down 1',
-  'forward 2',
+  "",
   'down 1',
   'down 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:590:3
   'up 7',
   'forward 6',
   'up 9',
-  'down 3',
+  "",
   'up 3',
   'forward 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:591:3
   'forward 6',
   'up 9',
   'down 3',
-  'up 3',
+  "",
   'forward 3',
   'down 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:592:3
   'up 9',
   'down 3',
   'up 3',
-  'forward 3',
+  "",
   'down 9',
   'down 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:593:3
   'down 3',
   'up 3',
   'forward 3',
-  'down 9',
+  "",
   'down 4',
   'down 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:594:3
   'up 3',
   'forward 3',
   'down 9',
-  'down 4',
+  "",
   'down 2',
   'forward 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:597:3
   'down 4',
   'down 2',
   'forward 7',
-  'forward 2',
+  "",
   'down 4',
   'forward 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:599:3
   'forward 7',
   'forward 2',
   'down 4',
-  'forward 5',
+  "",
   'up 1',
   'down 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:600:3
   'forward 2',
   'down 4',
   'forward 5',
-  'up 1',
+  "",
   'down 6',
   'down 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:603:3
   'up 1',
   'down 6',
   'down 6',
-  'up 2',
+  "",
   'down 2',
   'down 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:608:3
   'down 4',
   'down 4',
   'forward 8',
-  'down 3',
+  "",
   'down 5',
   'down 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:610:3
   'forward 8',
   'down 3',
   'down 5',
-  'down 3',
+  "",
   'up 2',
   'down 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:614:3
   'up 2',
   'down 6',
   'down 9',
-  'up 8',
+  "",
   'forward 3',
   'down 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:620:3
   'down 6',
   'down 7',
   'down 6',
-  'forward 9',
+  "",
   'up 1',
   'forward 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:623:3
   'forward 9',
   'up 1',
   'forward 9',
-  'down 8',
+  "",
   'forward 8',
   'up 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:626:3
   'down 8',
   'forward 8',
   'up 5',
-  'down 8',
+  "",
   'forward 5',
   'down 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:629:3
   'down 8',
   'forward 5',
   'down 6',
-  'down 9',
+  "",
   'forward 1',
   'up 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:634:3
   'up 5',
   'up 5',
   'forward 4',
-  'forward 1',
+  "",
   'forward 6',
   'down 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:644:3
   'down 9',
   'down 3',
   'forward 6',
-  'up 9',
+  "",
   'up 4',
   'down 1',
