[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:647:3
   'up 9',
   'up 4',
   'down 1',
-  'up 6',
+  "",
   'forward 3',
   'down 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:652:3
   'down 2',
   'down 8',
   'forward 1',
-  'forward 8',
+  "",
   'forward 4',
   'down 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:654:3
   'forward 1',
   'forward 8',
   'forward 4',
-  'down 4',
+  "",
   'down 5',
   'up 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:657:3
   'down 4',
   'down 5',
   'up 5',
-  'up 5',
+  "",
   'forward 7',
   'forward 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:659:3
   'up 5',
   'up 5',
   'forward 7',
-  'forward 6',
+  "",
   'forward 4',
   'down 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:665:3
   'forward 7',
   'down 4',
   'forward 2',
-  'forward 5',
+  "",
   'forward 3',
   'forward 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:669:3
   'forward 3',
   'forward 5',
   'up 6',
-  'up 9',
+  "",
   'down 6',
   'forward 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:675:3
   'down 3',
   'up 2',
   'forward 8',
-  'down 9',
+  "",
   'forward 9',
   'down 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:679:3
   'forward 9',
   'down 3',
   'down 4',
-  'down 5',
+  "",
   'up 3',
   'forward 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:683:3
   'up 3',
   'forward 6',
   'forward 6',
-  'forward 8',
+  "",
   'up 6',
   'up 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:691:3
   'down 5',
   'forward 1',
   'forward 8',
-  'up 5',
+  "",
   'down 2',
   'forward 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:695:3
   'down 2',
   'forward 4',
   'down 9',
-  'up 5',
+  "",
   'down 8',
   'forward 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:697:3
   'down 9',
   'up 5',
   'down 8',
-  'forward 6',
+  "",
   'forward 3',
   'down 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:698:3
   'up 5',
   'down 8',
   'forward 6',
-  'forward 3',
+  "",
   'down 8',
   'up 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:699:3
   'down 8',
   'forward 6',
   'forward 3',
-  'down 8',
+  "",
   'up 1',
   'down 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:700:3
   'forward 6',
   'forward 3',
   'down 8',
-  'up 1',
+  "",
   'down 5',
   'down 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:711:3
   'forward 1',
   'down 1',
   'down 3',
-  'down 8',
+  "",
   'down 1',
   'forward 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:712:3
   'down 1',
   'down 3',
   'down 8',
-  'down 1',
+  "",
   'forward 1',
   'forward 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:713:3
   'down 3',
   'down 8',
   'down 1',
-  'forward 1',
+  "",
   'forward 8',
   'up 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:722:3
   'forward 5',
   'forward 9',
   'forward 2',
-  'forward 4',
+  "",
   'forward 4',
   'down 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:723:3
   'forward 9',
   'forward 2',
   'forward 4',
-  'forward 4',
+  "",
   'down 1',
   'up 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:729:3
   'forward 3',
   'down 9',
   'forward 9',
-  'up 5',
+  "",
   'forward 7',
   'forward 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:731:3
   'forward 9',
   'up 5',
   'forward 7',
-  'forward 3',
+  "",
   'up 5',
   'up 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:750:3
   'down 6',
   'forward 4',
   'forward 7',
-  'down 6',
+  "",
   'forward 3',
   'forward 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:754:3
   'forward 3',
   'forward 5',
   'down 2',
-  'up 3',
+  "",
   'forward 3',
   'forward 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:768:3
   'down 7',
   'down 1',
   'down 6',
-  'up 7',
+  "",
   'forward 3',
   'forward 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:773:3
   'forward 9',
   'forward 9',
   'up 7',
-  'forward 2',
+  "",
   'up 5',
   'up 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:775:3
   'up 7',
   'forward 2',
   'up 5',
-  'up 6',
+  "",
   'down 7',
   'down 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:781:3
   'down 5',
   'forward 8',
   'down 1',
-  'up 4',
+  "",
   'down 4',
   'forward 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:784:3
   'up 4',
   'down 4',
   'forward 4',
-  'forward 3',
+  "",
   'forward 7',
   'forward 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:785:3
   'down 4',
   'forward 4',
   'forward 3',
-  'forward 7',
+  "",
   'forward 4',
   'down 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:800:3
   'up 5',
   'down 9',
   'up 8',
-  'down 6',
+  "",
   'down 8',
   'down 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:805:3
   'down 8',
   'down 8',
   'forward 2',
-  'down 8',
+  "",
   'down 4',
   'down 6',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:810:3
   'down 6',
   'forward 8',
   'forward 3',
-  'forward 2',
+  "",
   'down 5',
   'down 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:817:3
   'forward 2',
   'up 9',
   'forward 6',
-  'down 8',
+  "",
   'up 2',
   'down 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:820:3
   'down 8',
   'up 2',
   'down 2',
-  'forward 7',
+  "",
   'up 6',
   'up 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:823:3
   'forward 7',
   'up 6',
   'up 2',
-  'forward 1',
+  "",
   'down 2',
   'forward 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:827:3
   'down 2',
   'forward 7',
   'forward 4',
-  'down 6',
+  "",
   'forward 4',
   'up 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:831:3
   'forward 4',
   'up 4',
   'forward 3',
-  'down 2',
+  "",
   'down 5',
   'up 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:833:3
   'forward 3',
   'down 2',
   'down 5',
-  'up 5',
+  "",
   'down 2',
   'down 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:837:3
   'down 2',
   'down 1',
   'down 9',
-  'forward 3',
+  "",
   'down 5',
   'up 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:842:3
   'up 8',
   'down 6',
   'forward 3',
-  'forward 9',
+  "",
   'up 6',
   'down 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:844:3
   'forward 3',
   'forward 9',
   'up 6',
-  'down 2',
+  "",
   'forward 6',
   'forward 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:849:3
   'forward 7',
   'down 1',
   'up 9',
-  'up 9',
+  "",
   'up 9',
   'up 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:856:3
   'down 7',
   'down 1',
   'forward 8',
-  'down 2',
+  "",
   'down 1',
   'forward 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:858:3
   'forward 8',
   'down 2',
   'down 1',
-  'forward 9',
+  "",
   'forward 8',
   'up 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:868:3
   'down 3',
   'down 1',
   'forward 2',
-  'down 2',
+  "",
   'down 6',
   'forward 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:869:3
   'down 1',
   'forward 2',
   'down 2',
-  'down 6',
+  "",
   'forward 5',
   'down 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:871:3
   'down 2',
   'down 6',
   'forward 5',
-  'down 9',
+  "",
   'forward 8',
   'down 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:880:3
   'forward 3',
   'down 9',
   'up 6',
-  'down 8',
+  "",
   'down 3',
   'down 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:881:3
   'down 9',
   'up 6',
   'down 8',
-  'down 3',
+  "",
   'down 2',
   'up 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:884:3
   'down 3',
   'down 2',
   'up 1',
-  'up 9',
+  "",
   'up 7',
   'up 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:885:3
   'down 2',
   'up 1',
   'up 9',
-  'up 7',
+  "",
   'up 1',
   'up 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:887:3
   'up 9',
   'up 7',
   'up 1',
-  'up 4',
+  "",
   'forward 7',
   'down 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:891:3
   'forward 7',
   'down 8',
   'up 3',
-  'forward 1',
+  "",
   'up 3',
   'up 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:893:3
   'up 3',
   'forward 1',
   'up 3',
-  'up 7',
+  "",
   'forward 4',
   'up 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:895:3
   'up 3',
   'up 7',
   'forward 4',
-  'up 3',
+  "",
   'down 1',
   'forward 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:902:3
   'forward 7',
   'down 4',
   'down 4',
-  'down 2',
+  "",
   'up 1',
   'up 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:906:3
   'up 1',
   'up 5',
   'up 3',
-  'forward 6',
+  "",
   'forward 6',
   'forward 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:907:3
   'up 5',
   'up 3',
   'forward 6',
-  'forward 6',
+  "",
   'forward 9',
   'down 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:911:3
   'forward 9',
   'down 9',
   'forward 2',
-  'up 3',
+  "",
   'forward 3',
   'down 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:915:3
   'forward 3',
   'down 2',
   'down 4',
-  'forward 6',
+  "",
   'forward 7',
   'down 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:919:3
   'forward 7',
   'down 5',
   'forward 9',
-  'up 7',
+  "",
   'down 9',
   'down 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:921:3
   'forward 9',
   'up 7',
   'down 9',
-  'down 1',
+  "",
   'down 1',
   'forward 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:929:3
   'down 5',
   'forward 4',
   'up 3',
-  'down 1',
+  "",
   'down 3',
   'forward 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:935:3
   'forward 6',
   'up 4',
   'down 2',
-  'forward 1',
+  "",
   'forward 5',
   'forward 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:937:3
   'down 2',
   'forward 1',
   'forward 5',
-  'forward 3',
+  "",
   'forward 2',
   'forward 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:940:3
   'forward 3',
   'forward 2',
   'forward 4',
-  'down 3',
+  "",
   'forward 2',
   'down 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:941:3
   'forward 2',
   'forward 4',
   'down 3',
-  'forward 2',
+  "",
   'down 4',
   'down 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:942:3
   'forward 4',
   'down 3',
   'forward 2',
-  'down 4',
+  "",
   'down 7',
   'up 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:946:3
   'down 7',
   'up 4',
   'down 7',
-  'forward 8',
+  "",
   'forward 2',
   'down 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:947:3
   'up 4',
   'down 7',
   'forward 8',
-  'forward 2',
+  "",
   'down 4',
   'down 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:952:3
   'down 2',
   'forward 8',
   'up 7',
-  'forward 1',
+  "",
   'up 4',
   'forward 4',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:954:3
   'up 7',
   'forward 1',
   'up 4',
-  'forward 4',
+  "",
   'up 7',
   'forward 2',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:955:3
   'forward 1',
   'up 4',
   'forward 4',
-  'up 7',
+  "",
   'forward 2',
   'forward 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:957:3
   'forward 4',
   'up 7',
   'forward 2',
-  'forward 7',
+  "",
   'forward 9',
   'down 8',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:960:3
   'forward 7',
   'forward 9',
   'down 8',
-  'down 2',
+  "",
   'forward 8',
   'down 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:967:3
   'forward 3',
   'up 9',
   'forward 8',
-  'forward 5',
+  "",
   'up 2',
   'down 5',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:970:3
   'forward 5',
   'up 2',
   'down 5',
-  'down 9',
+  "",
   'up 9',
   'forward 1',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:971:3
   'up 2',
   'down 5',
   'down 9',
-  'up 9',
+  "",
   'forward 1',
   'forward 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:986:3
   'up 1',
   'forward 3',
   'down 4',
-  'down 8',
+  "",
   'up 4',
   'down 9',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:988:3
   'down 4',
   'down 8',
   'up 4',
-  'down 9',
+  "",
   'forward 6',
   'down 7',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:989:3
   'down 8',
   'up 4',
   'down 9',
-  'forward 6',
+  "",
   'down 7',
   'down 3',

[NoCoverage] StringLiteral
AventOfCode/src/Day2/dive-data.ts:990:3
   'up 4',
   'down 9',
   'forward 6',
-  'down 7',
+  "",
   'down 3',
   'down 9',
