[Killed] BlockStatement
AventOfCode/src/Day2/dive.ts:4:53
 import Coordinates from './Coordinates';
 import Order from './Order';
 
-export function dive(orderStr: string): Coordinates {
-  const order = new Order(orderStr);
-  switch (order.direction) {
-    case 'forward': {
-      return new Coordinates(order.unit, 0, 0);
-    }
-    case 'down': {
-      return new Coordinates(0, 0, order.unit);
-    }
-    case 'up': {
-      return new Coordinates(0, 0, -order.unit);
-    }
-    default: {
-      return new Coordinates(1, 0, 0);
-    }
-  }
-}
+export function dive(orderStr: string): Coordinates {}
 
 export function diveFrom(orderStr: string, position: Coordinates): Coordinates {
killedBy: simple dive should return [1,0] when it is forward 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"aim": 0, "depth": 0, "horizontal": 1}
Received: undefined

[Killed] ConditionalExpression
AventOfCode/src/Day2/dive.ts:7:5
 export function dive(orderStr: string): Coordinates {
   const order = new Order(orderStr);
   switch (order.direction) {
-    case 'forward': {
-      return new Coordinates(order.unit, 0, 0);
-    }
+    case 'forward':
     case 'down': {
       return new Coordinates(0, 0, order.unit);
killedBy: simple dive should return [1,0] when it is forward 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Coordinates {
-   "aim": 0,
+   "aim": 1,

[Killed] BlockStatement
AventOfCode/src/Day2/dive.ts:7:21
 export function dive(orderStr: string): Coordinates {
   const order = new Order(orderStr);
   switch (order.direction) {
-    case 'forward': {
-      return new Coordinates(order.unit, 0, 0);
-    }
+    case 'forward': {}
     case 'down': {
       return new Coordinates(0, 0, order.unit);
killedBy: simple dive should return [1,0] when it is forward 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Coordinates {
-   "aim": 0,
+   "aim": 1,

[Killed] BlockStatement
AventOfCode/src/Day2/dive.ts:10:18
     case 'forward': {
       return new Coordinates(order.unit, 0, 0);
     }
-    case 'down': {
-      return new Coordinates(0, 0, order.unit);
-    }
+    case 'down': {}
     case 'up': {
       return new Coordinates(0, 0, -order.unit);
killedBy: simple dive should return [0,0,1] when it is down 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Coordinates {
-   "aim": 1,
+   "aim": -1,

[Killed] ConditionalExpression
AventOfCode/src/Day2/dive.ts:10:5
     case 'forward': {
       return new Coordinates(order.unit, 0, 0);
     }
-    case 'down': {
-      return new Coordinates(0, 0, order.unit);
-    }
+    case 'down':
     case 'up': {
       return new Coordinates(0, 0, -order.unit);
killedBy: simple dive should return [0,0,1] when it is down 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Coordinates {
-   "aim": 1,
+   "aim": -1,

[Killed] BlockStatement
AventOfCode/src/Day2/dive.ts:13:16
     case 'down': {
       return new Coordinates(0, 0, order.unit);
     }
-    case 'up': {
-      return new Coordinates(0, 0, -order.unit);
-    }
+    case 'up': {}
     default: {
       return new Coordinates(1, 0, 0);
killedBy: simple dive should return [0,0,-1] when it is up 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Coordinates {
-   "aim": -1,
+   "aim": 0,

[Killed] ConditionalExpression
AventOfCode/src/Day2/dive.ts:13:5
     case 'down': {
       return new Coordinates(0, 0, order.unit);
     }
-    case 'up': {
-      return new Coordinates(0, 0, -order.unit);
-    }
+    case 'up':
     default: {
       return new Coordinates(1, 0, 0);
killedBy: simple dive should return [0,0,-1] when it is up 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Coordinates {
-   "aim": -1,
+   "aim": 0,

[Killed] UnaryOperator
AventOfCode/src/Day2/dive.ts:14:36
       return new Coordinates(0, 0, order.unit);
     }
     case 'up': {
-      return new Coordinates(0, 0, -order.unit);
+      return new Coordinates(0, 0, +order.unit);
     }
     default: {
killedBy: simple dive should return [0,0,-1] when it is up 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Coordinates {
-   "aim": -1,
+   "aim": 1,

[NoCoverage] BlockStatement
AventOfCode/src/Day2/dive.ts:16:14
     case 'up': {
       return new Coordinates(0, 0, -order.unit);
     }
-    default: {
-      return new Coordinates(1, 0, 0);
-    }
+    default: {}
   }
 }

[NoCoverage] ConditionalExpression
AventOfCode/src/Day2/dive.ts:16:5
     case 'up': {
       return new Coordinates(0, 0, -order.unit);
     }
-    default: {
-      return new Coordinates(1, 0, 0);
-    }
+    default:
   }
 }

[Killed] BlockStatement
AventOfCode/src/Day2/dive.ts:22:80
   }
 }
 
-export function diveFrom(orderStr: string, position: Coordinates): Coordinates {
-  const delta = dive(orderStr);
-  const depth = position.depth + position.aim * delta.horizontal;
-  const horizontal = position.horizontal + delta.horizontal;
-  const aim = position.aim + delta.aim;
-  return new Coordinates(horizontal, depth, aim);
-}
+export function diveFrom(orderStr: string, position: Coordinates): Coordinates {}
 
 export function diveWithAimFrom(
killedBy: dive from position should return [2,1,0] when it is forward 1 from position [1,1,0]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"aim": 0, "depth": 1, "horizontal": 2}
Received: undefined

[Killed] ArithmeticOperator
AventOfCode/src/Day2/dive.ts:24:34
 
 export function diveFrom(orderStr: string, position: Coordinates): Coordinates {
   const delta = dive(orderStr);
-  const depth = position.depth + position.aim * delta.horizontal;
+  const depth = position.depth + position.aim / delta.horizontal;
   const horizontal = position.horizontal + delta.horizontal;
   const aim = position.aim + delta.aim;
killedBy: dive from position should return [1,1,1] when it is down 1 from position [1,1,0]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Coordinates {
    "aim": 1,
-   "depth": 1,

[Killed] ArithmeticOperator
AventOfCode/src/Day2/dive.ts:24:17
 
 export function diveFrom(orderStr: string, position: Coordinates): Coordinates {
   const delta = dive(orderStr);
-  const depth = position.depth + position.aim * delta.horizontal;
+  const depth = position.depth - position.aim * delta.horizontal;
   const horizontal = position.horizontal + delta.horizontal;
   const aim = position.aim + delta.aim;
killedBy: dive with array should return 900 when it is forward 1 from example array 
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 900
Received: -900

[Killed] ArithmeticOperator
AventOfCode/src/Day2/dive.ts:25:22
 export function diveFrom(orderStr: string, position: Coordinates): Coordinates {
   const delta = dive(orderStr);
   const depth = position.depth + position.aim * delta.horizontal;
-  const horizontal = position.horizontal + delta.horizontal;
+  const horizontal = position.horizontal - delta.horizontal;
   const aim = position.aim + delta.aim;
   return new Coordinates(horizontal, depth, aim);
killedBy: dive from position should return [2,1,0] when it is forward 1 from position [1,1,0]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Coordinates {
    "aim": 0,
    "depth": 1,

[Killed] ArithmeticOperator
AventOfCode/src/Day2/dive.ts:26:15
   const delta = dive(orderStr);
   const depth = position.depth + position.aim * delta.horizontal;
   const horizontal = position.horizontal + delta.horizontal;
-  const aim = position.aim + delta.aim;
+  const aim = position.aim - delta.aim;
   return new Coordinates(horizontal, depth, aim);
 }
killedBy: dive from position should return [1,1,1] when it is down 1 from position [1,1,0]
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Coordinates {
-   "aim": 1,
+   "aim": -1,

[NoCoverage] BlockStatement
AventOfCode/src/Day2/dive.ts:33:16
 export function diveWithAimFrom(
   orderStr: string,
   position: Coordinates
-): Coordinates {
-  const delta = dive(orderStr);
-  const depth = position.depth + position.aim * delta.horizontal;
-  const horizontal = position.horizontal + delta.horizontal;
-  const aim = position.aim + delta.aim;
-  return new Coordinates(horizontal, depth, aim);
-}
+): Coordinates {}
 
 export function diveFromArray(orders: string[]): Coordinates {

[Killed] BlockStatement
AventOfCode/src/Day2/dive.ts:41:62
   return new Coordinates(horizontal, depth, aim);
 }
 
-export function diveFromArray(orders: string[]): Coordinates {
-  let position = new Coordinates(0, 0, 0);
-  for (let i = 0; i < orders.length; i++) {
-    position = diveFrom(orders[i], position);
-  }
-  return position;
-}
+export function diveFromArray(orders: string[]): Coordinates {}
 
 export function diveFromArrayWithAim(orders: string[]): Coordinates {
killedBy: dive with array should return 900 when it is forward 1 from example array 
statusReason: TypeError: Cannot read properties of undefined (reading 'multiply')

[Killed] UpdateOperator
AventOfCode/src/Day2/dive.ts:43:38
 
 export function diveFromArray(orders: string[]): Coordinates {
   let position = new Coordinates(0, 0, 0);
-  for (let i = 0; i < orders.length; i++) {
+  for (let i = 0; i < orders.length; i--) {
     position = diveFrom(orders[i], position);
   }
killedBy: dive with array should return 900 when it is forward 1 from example array 
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] EqualityOperator
AventOfCode/src/Day2/dive.ts:43:19
 
 export function diveFromArray(orders: string[]): Coordinates {
   let position = new Coordinates(0, 0, 0);
-  for (let i = 0; i < orders.length; i++) {
+  for (let i = 0; i <= orders.length; i++) {
     position = diveFrom(orders[i], position);
   }
killedBy: dive with array should return 900 when it is forward 1 from example array 
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[NoCoverage] BlockStatement
AventOfCode/src/Day2/dive.ts:49:69
   return position;
 }
 
-export function diveFromArrayWithAim(orders: string[]): Coordinates {
-  let position = new Coordinates(0, 0, 0);
-  for (let i = 0; i < orders.length; i++) {
-    position = diveWithAimFrom(orders[i], position);
-  }
-  return position;
-}
+export function diveFromArrayWithAim(orders: string[]): Coordinates {}
 
 export function getFinalPositionAfterDive(orders: string[]): number {

[NoCoverage] BlockStatement
AventOfCode/src/Day2/dive.ts:57:69
   return position;
 }
 
-export function getFinalPositionAfterDive(orders: string[]): number {
-  return diveFromArray(orders).multiply();
-}
+export function getFinalPositionAfterDive(orders: string[]): number {}
 
 export function getFinalPositionAfterDiveWithAim(orders: string[]): number {

[NoCoverage] BlockStatement
AventOfCode/src/Day2/dive.ts:61:76
   return diveFromArray(orders).multiply();
 }
 
-export function getFinalPositionAfterDiveWithAim(orders: string[]): number {
-  return diveFromArrayWithAim(orders).multiply();
-}
+export function getFinalPositionAfterDiveWithAim(orders: string[]): number {}
 
