[Killed] BlockStatement
AventOfCode/src/Day1/sonar.ts:1:70
-export function compareNumber(first: number, second: number): string {
-  if (first < second) {
-    return 'increased';
-  }
-  if (first === second) {
-    return 'no change';
-  }
-  return 'decreased';
-}
+export function compareNumber(first: number, second: number): string {}
 
 export function analyseSimpleArray(arrayOfNumber: number[]): string[] {
killedBy: analyse number should return "increased" when the first number is lower than the second
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "increased"
Received: undefined

[Killed] EqualityOperator
AventOfCode/src/Day1/sonar.ts:2:7
 export function compareNumber(first: number, second: number): string {
-  if (first < second) {
+  if (first <= second) {
     return 'increased';
   }
killedBy: analyse deep array should return "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Array [
    "N/A - no previous sum",

[Killed] ConditionalExpression
AventOfCode/src/Day1/sonar.ts:2:7
 export function compareNumber(first: number, second: number): string {
-  if (first < second) {
+  if (true) {
     return 'increased';
   }
killedBy: analyse number should return "decreased" when the first number is greater than the second
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "decreased"
Received: "increased"

[Killed] StringLiteral
AventOfCode/src/Day1/sonar.ts:3:12
 export function compareNumber(first: number, second: number): string {
   if (first < second) {
-    return 'increased';
+    return "";
   }
   if (first === second) {
killedBy: analyse number should return "increased" when the first number is lower than the second
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "increased"
Received: ""

[Killed] BlockStatement
AventOfCode/src/Day1/sonar.ts:5:25
   if (first < second) {
     return 'increased';
   }
-  if (first === second) {
-    return 'no change';
-  }
+  if (first === second) {}
   return 'decreased';
 }
killedBy: analyse deep array should return "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Array [
    "N/A - no previous sum",

[Killed] ConditionalExpression
AventOfCode/src/Day1/sonar.ts:5:7
   if (first < second) {
     return 'increased';
   }
-  if (first === second) {
+  if (false) {
     return 'no change';
   }
killedBy: analyse deep array should return "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Array [
    "N/A - no previous sum",

[Killed] StringLiteral
AventOfCode/src/Day1/sonar.ts:8:10
   if (first === second) {
     return 'no change';
   }
-  return 'decreased';
+  return "";
 }
 
killedBy: analyse number should return "decreased" when the first number is greater than the second
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "decreased"
Received: ""

[Killed] BlockStatement
AventOfCode/src/Day1/sonar.ts:11:71
   return 'decreased';
 }
 
-export function analyseSimpleArray(arrayOfNumber: number[]): string[] {
-  const result: string[] = [];
-  for (let i = 0; i < arrayOfNumber.length - 1; i++) {
-    result.push(compareNumber(arrayOfNumber[i], arrayOfNumber[i + 1]));
-  }
-  return result;
-}
+export function analyseSimpleArray(arrayOfNumber: number[]): string[] {}
 
 export function analyseDeepArray(arrayOfNumber: number[]): string[] {
killedBy: analyse simple array should return "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: ["increased"]
Received: undefined

[Killed] BlockStatement
AventOfCode/src/Day1/sonar.ts:13:54
 
 export function analyseSimpleArray(arrayOfNumber: number[]): string[] {
   const result: string[] = [];
-  for (let i = 0; i < arrayOfNumber.length - 1; i++) {
-    result.push(compareNumber(arrayOfNumber[i], arrayOfNumber[i + 1]));
-  }
+  for (let i = 0; i < arrayOfNumber.length - 1; i++) {}
   return result;
 }
killedBy: analyse simple array should return "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "increased",
- ]

[Killed] ConditionalExpression
AventOfCode/src/Day1/sonar.ts:13:19
 
 export function analyseSimpleArray(arrayOfNumber: number[]): string[] {
   const result: string[] = [];
-  for (let i = 0; i < arrayOfNumber.length - 1; i++) {
+  for (let i = 0; false; i++) {
     result.push(compareNumber(arrayOfNumber[i], arrayOfNumber[i + 1]));
   }
killedBy: analyse simple array should return "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "increased",
- ]

[Killed] ArithmeticOperator
AventOfCode/src/Day1/sonar.ts:14:63
 export function analyseSimpleArray(arrayOfNumber: number[]): string[] {
   const result: string[] = [];
   for (let i = 0; i < arrayOfNumber.length - 1; i++) {
-    result.push(compareNumber(arrayOfNumber[i], arrayOfNumber[i + 1]));
+    result.push(compareNumber(arrayOfNumber[i], arrayOfNumber[i - 1]));
   }
   return result;
killedBy: analyse simple array should return "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "increased",
+   "decreased",

[Killed] BlockStatement
AventOfCode/src/Day1/sonar.ts:19:69
   return result;
 }
 
-export function analyseDeepArray(arrayOfNumber: number[]): string[] {
-  const result: string[] = [];
-  let curr = 0;
-  let prev = 0;
-  for (let i = 0; i < arrayOfNumber.length - 2; i++) {
-    if (i === 0) {
-      result.push('N/A - no previous sum');
-      prev = arrayOfNumber[i] + arrayOfNumber[i + 1] + arrayOfNumber[i + 2];
-    } else {
-      curr = arrayOfNumber[i] + arrayOfNumber[i + 1] + arrayOfNumber[i + 2];
-      result.push(compareNumber(prev, curr));
-      prev = curr;
-    }
-  }
-  return result;
-}
+export function analyseDeepArray(arrayOfNumber: number[]): string[] {}
 
 export function getNumberOfIncreasedFromSimpleArrayOfNumber(
killedBy: analyse deep array should return "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: ["N/A - no previous sum", "increased", "no change", "decreased", "increased", "increased", "increased", "increased"]
Received: undefined

[Killed] ConditionalExpression
AventOfCode/src/Day1/sonar.ts:23:19
   const result: string[] = [];
   let curr = 0;
   let prev = 0;
-  for (let i = 0; i < arrayOfNumber.length - 2; i++) {
+  for (let i = 0; false; i++) {
     if (i === 0) {
       result.push('N/A - no previous sum');
killedBy: analyse deep array should return "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   "N/A - no previous sum",
-   "increased",

[Killed] EqualityOperator
AventOfCode/src/Day1/sonar.ts:23:19
   const result: string[] = [];
   let curr = 0;
   let prev = 0;
-  for (let i = 0; i < arrayOfNumber.length - 2; i++) {
+  for (let i = 0; i >= arrayOfNumber.length - 2; i++) {
     if (i === 0) {
       result.push('N/A - no previous sum');
killedBy: analyse deep array should return "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   "N/A - no previous sum",
-   "increased",

[Killed] ConditionalExpression
AventOfCode/src/Day1/sonar.ts:24:9
   let curr = 0;
   let prev = 0;
   for (let i = 0; i < arrayOfNumber.length - 2; i++) {
-    if (i === 0) {
+    if (false) {
       result.push('N/A - no previous sum');
       prev = arrayOfNumber[i] + arrayOfNumber[i + 1] + arrayOfNumber[i + 2];
killedBy: analyse deep array should return "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Array [
-   "N/A - no previous sum",

[Killed] EqualityOperator
AventOfCode/src/Day1/sonar.ts:24:9
   let curr = 0;
   let prev = 0;
   for (let i = 0; i < arrayOfNumber.length - 2; i++) {
-    if (i === 0) {
+    if (i !== 0) {
       result.push('N/A - no previous sum');
       prev = arrayOfNumber[i] + arrayOfNumber[i + 1] + arrayOfNumber[i + 2];
killedBy: analyse deep array should return "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 7
+ Received  + 7

  Array [
-   "N/A - no previous sum",
-   "increased",

[Killed] ArithmeticOperator
AventOfCode/src/Day1/sonar.ts:26:47
   for (let i = 0; i < arrayOfNumber.length - 2; i++) {
     if (i === 0) {
       result.push('N/A - no previous sum');
-      prev = arrayOfNumber[i] + arrayOfNumber[i + 1] + arrayOfNumber[i + 2];
+      prev = arrayOfNumber[i] + arrayOfNumber[i - 1] + arrayOfNumber[i + 2];
     } else {
       curr = arrayOfNumber[i] + arrayOfNumber[i + 1] + arrayOfNumber[i + 2];
killedBy: analyse deep array should return "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Array [
    "N/A - no previous sum",

[Killed] ArithmeticOperator
AventOfCode/src/Day1/sonar.ts:26:70
   for (let i = 0; i < arrayOfNumber.length - 2; i++) {
     if (i === 0) {
       result.push('N/A - no previous sum');
-      prev = arrayOfNumber[i] + arrayOfNumber[i + 1] + arrayOfNumber[i + 2];
+      prev = arrayOfNumber[i] + arrayOfNumber[i + 1] + arrayOfNumber[i - 2];
     } else {
       curr = arrayOfNumber[i] + arrayOfNumber[i + 1] + arrayOfNumber[i + 2];
killedBy: analyse deep array should return "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Array [
    "N/A - no previous sum",

[Killed] BlockStatement
AventOfCode/src/Day1/sonar.ts:27:12
     if (i === 0) {
       result.push('N/A - no previous sum');
       prev = arrayOfNumber[i] + arrayOfNumber[i + 1] + arrayOfNumber[i + 2];
-    } else {
-      curr = arrayOfNumber[i] + arrayOfNumber[i + 1] + arrayOfNumber[i + 2];
-      result.push(compareNumber(prev, curr));
-      prev = curr;
-    }
+    } else {}
   }
   return result;
killedBy: analyse deep array should return "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 7
+ Received  + 0

  Array [
    "N/A - no previous sum",
-   "increased",

[Killed] ArithmeticOperator
AventOfCode/src/Day1/sonar.ts:28:70
       result.push('N/A - no previous sum');
       prev = arrayOfNumber[i] + arrayOfNumber[i + 1] + arrayOfNumber[i + 2];
     } else {
-      curr = arrayOfNumber[i] + arrayOfNumber[i + 1] + arrayOfNumber[i + 2];
+      curr = arrayOfNumber[i] + arrayOfNumber[i + 1] + arrayOfNumber[i - 2];
       result.push(compareNumber(prev, curr));
       prev = curr;
killedBy: analyse deep array should return "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -1,9 +1,9 @@
  Array [
    "N/A - no previous sum",

[Killed] ArithmeticOperator
AventOfCode/src/Day1/sonar.ts:28:47
       result.push('N/A - no previous sum');
       prev = arrayOfNumber[i] + arrayOfNumber[i + 1] + arrayOfNumber[i + 2];
     } else {
-      curr = arrayOfNumber[i] + arrayOfNumber[i + 1] + arrayOfNumber[i + 2];
+      curr = arrayOfNumber[i] + arrayOfNumber[i - 1] + arrayOfNumber[i + 2];
       result.push(compareNumber(prev, curr));
       prev = curr;
killedBy: analyse deep array should return "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "N/A - no previous sum",
    "increased",

[Killed] BlockStatement
AventOfCode/src/Day1/sonar.ts:38:3
 
 export function getNumberOfIncreasedFromSimpleArrayOfNumber(
   arrayOfNumber: number[]
-) {
-  const anlyseOfAscendingAndDescending = analyseSimpleArray(arrayOfNumber);
-  let countOfIncreased = 0;
-  for (let i = 0; i < anlyseOfAscendingAndDescending.length; i++) {
-    if (anlyseOfAscendingAndDescending[i] === 'increased') {
-      countOfIncreased++;
-    }
-  }
-  return countOfIncreased;
-}
+) {}
 
 export function getNumberOfIncreasedFromDeepArrayOfNumber(
killedBy: counting array should count 1 "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: undefined

[Killed] EqualityOperator
AventOfCode/src/Day1/sonar.ts:41:19
 ) {
   const anlyseOfAscendingAndDescending = analyseSimpleArray(arrayOfNumber);
   let countOfIncreased = 0;
-  for (let i = 0; i < anlyseOfAscendingAndDescending.length; i++) {
+  for (let i = 0; i >= anlyseOfAscendingAndDescending.length; i++) {
     if (anlyseOfAscendingAndDescending[i] === 'increased') {
       countOfIncreased++;
killedBy: counting array should count 1 "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] BlockStatement
AventOfCode/src/Day1/sonar.ts:41:67
 ) {
   const anlyseOfAscendingAndDescending = analyseSimpleArray(arrayOfNumber);
   let countOfIncreased = 0;
-  for (let i = 0; i < anlyseOfAscendingAndDescending.length; i++) {
-    if (anlyseOfAscendingAndDescending[i] === 'increased') {
-      countOfIncreased++;
-    }
-  }
+  for (let i = 0; i < anlyseOfAscendingAndDescending.length; i++) {}
   return countOfIncreased;
 }
killedBy: counting array should count 1 "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] BlockStatement
AventOfCode/src/Day1/sonar.ts:42:60
   const anlyseOfAscendingAndDescending = analyseSimpleArray(arrayOfNumber);
   let countOfIncreased = 0;
   for (let i = 0; i < anlyseOfAscendingAndDescending.length; i++) {
-    if (anlyseOfAscendingAndDescending[i] === 'increased') {
-      countOfIncreased++;
-    }
+    if (anlyseOfAscendingAndDescending[i] === 'increased') {}
   }
   return countOfIncreased;
killedBy: counting array should count 1 "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
AventOfCode/src/Day1/sonar.ts:42:9
   const anlyseOfAscendingAndDescending = analyseSimpleArray(arrayOfNumber);
   let countOfIncreased = 0;
   for (let i = 0; i < anlyseOfAscendingAndDescending.length; i++) {
-    if (anlyseOfAscendingAndDescending[i] === 'increased') {
+    if (true) {
       countOfIncreased++;
     }
killedBy: counting array should count 3 "increased" when analysing an array of 3 ascending numbers with 2 descending number
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: 5

[Killed] UpdateOperator
AventOfCode/src/Day1/sonar.ts:43:7
   let countOfIncreased = 0;
   for (let i = 0; i < anlyseOfAscendingAndDescending.length; i++) {
     if (anlyseOfAscendingAndDescending[i] === 'increased') {
-      countOfIncreased++;
+      countOfIncreased--;
     }
   }
killedBy: counting array should count 1 "increased" when analysing an array of 2 ascending numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: -1

[Killed] BlockStatement
AventOfCode/src/Day1/sonar.ts:51:3
 
 export function getNumberOfIncreasedFromDeepArrayOfNumber(
   arrayOfNumber: number[]
-) {
-  const anlyseOfAscendingAndDescending = analyseDeepArray(arrayOfNumber);
-  let countOfIncreased = 0;
-  for (let i = 0; i < anlyseOfAscendingAndDescending.length; i++) {
-    if (anlyseOfAscendingAndDescending[i] === 'increased') {
-      countOfIncreased++;
-    }
-  }
-  return countOfIncreased;
-}
+) {}
 
killedBy: counting array should count 5 "increased" when deep analyzing the array from the site
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: undefined

[Killed] ConditionalExpression
AventOfCode/src/Day1/sonar.ts:54:19
 ) {
   const anlyseOfAscendingAndDescending = analyseDeepArray(arrayOfNumber);
   let countOfIncreased = 0;
-  for (let i = 0; i < anlyseOfAscendingAndDescending.length; i++) {
+  for (let i = 0; false; i++) {
     if (anlyseOfAscendingAndDescending[i] === 'increased') {
       countOfIncreased++;
killedBy: counting array should count 5 "increased" when deep analyzing the array from the site
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
AventOfCode/src/Day1/sonar.ts:55:9
   const anlyseOfAscendingAndDescending = analyseDeepArray(arrayOfNumber);
   let countOfIncreased = 0;
   for (let i = 0; i < anlyseOfAscendingAndDescending.length; i++) {
-    if (anlyseOfAscendingAndDescending[i] === 'increased') {
+    if (false) {
       countOfIncreased++;
     }
killedBy: counting array should count 5 "increased" when deep analyzing the array from the site
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 0
