[Survived] BlockStatement
AventOfCode/src/Day2/Coordinates.ts:8:63
 
   aim: number;
 
-  constructor(horizontal: number, depth: number, aim: number) {
-    this.horizontal = horizontal;
-    this.depth = depth;
-    this.aim = aim;
-  }
+  constructor(horizontal: number, depth: number, aim: number) {}
 
   multiply(): number {

[Survived] BlockStatement
AventOfCode/src/Day2/Coordinates.ts:14:22
     this.aim = aim;
   }
 
-  multiply(): number {
-    return this.horizontal * this.depth;
-  }
+  multiply(): number {}
 }
 

[Survived] ArithmeticOperator
AventOfCode/src/Day2/Coordinates.ts:15:12
   }
 
   multiply(): number {
-    return this.horizontal * this.depth;
+    return this.horizontal / this.depth;
   }
 }
