[Killed] BlockStatement
AventOfCode/src/Day2/Order.ts:6:30
 
   unit: number;
 
-  constructor(order: string) {
-    const [direction] = order.split(' ');
-    this.direction = direction;
-    this.unit = Number.parseInt(order.split(' ')[1], 10);
-  }
+  constructor(order: string) {}
 }
 
killedBy: simple dive should return [0,0,1] when it is down 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Coordinates {
-   "aim": 1,
+   "aim": 0,

[Killed] StringLiteral
AventOfCode/src/Day2/Order.ts:9:45
   constructor(order: string) {
     const [direction] = order.split(' ');
     this.direction = direction;
-    this.unit = Number.parseInt(order.split(' ')[1], 10);
+    this.unit = Number.parseInt(order.split("")[1], 10);
   }
 }
killedBy: simple dive should return [1,0] when it is forward 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Coordinates {
    "aim": 0,
    "depth": 0,
